in/wscode/order.wsdl

<?xml version='1.0' encoding='UTF-8'?><wsdl:definitions xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:tns="http://wscodefirst.danielbgg.com.br/" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:ns1="http://schemas.xmlsoap.org/soap/http" name="orderProcessor" targetNamespace="http://wscodefirst.danielbgg.com.br/">
  <wsdl:types>
<xs:schema xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://wscodefirst.danielbgg.com.br/" elementFormDefault="unqualified" targetNamespace="http://wscodefirst.danielbgg.com.br/" version="1.0">

  <xs:element name="getAvailableItems" type="tns:getAvailableItems"/>

  <xs:element name="getAvailableItemsResponse" type="tns:getAvailableItemsResponse"/>

  <xs:complexType name="getAvailableItems">
    <xs:sequence>
      <xs:element minOccurs="0" name="itemName" type="xs:string"/>
    </xs:sequence>
  </xs:complexType>

  <xs:complexType name="getAvailableItemsResponse">
    <xs:sequence>
      <xs:element name="return" type="xs:int"/>
    </xs:sequence>
  </xs:complexType>

</xs:schema>
  </wsdl:types>
  <wsdl:message name="getAvailableItems">
    <wsdl:part element="tns:getAvailableItems" name="parameters">
    </wsdl:part>
  </wsdl:message>
  <wsdl:message name="getAvailableItemsResponse">
    <wsdl:part element="tns:getAvailableItemsResponse" name="parameters">
    </wsdl:part>
  </wsdl:message>
  <wsdl:portType name="OrderProcessor">
    <wsdl:operation name="getAvailableItems">
      <wsdl:input message="tns:getAvailableItems" name="getAvailableItems">
    </wsdl:input>
      <wsdl:output message="tns:getAvailableItemsResponse" name="getAvailableItemsResponse">
    </wsdl:output>
    </wsdl:operation>
  </wsdl:portType>
  <wsdl:binding name="orderProcessorSoapBinding" type="tns:OrderProcessor">
    <soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
    <wsdl:operation name="getAvailableItems">
      <soap:operation soapAction="" style="document"/>
      <wsdl:input name="getAvailableItems">
        <soap:body use="literal"/>
      </wsdl:input>
      <wsdl:output name="getAvailableItemsResponse">
        <soap:body use="literal"/>
      </wsdl:output>
    </wsdl:operation>
  </wsdl:binding>
  <wsdl:service name="orderProcessor">
    <wsdl:port binding="tns:orderProcessorSoapBinding" name="OrderProcessorImplPort">
      <soap:address location="http://localhost:9000/order"/>
    </wsdl:port>
  </wsdl:service>
</wsdl:definitions>